#coding:utf-8
import pandas as pd
import numpy as np
from .merge_data import merge_data
from sklearn.externals import joblib
import xgboost as xgb
import datetime
def predict_(base_root,money_report_root,year_report_root,paient_information_root):
    finally_data = merge_data.merge_data(base_root,money_report_root,year_report_root,paient_information_root)
    target = finally_data['flag']
    features = finally_data.columns.tolist()

    # 删除无用特征
    if 'Unnamed: 0' in features:
        features.remove('Unnamed: 0')
    if 'ID' in features:
        features.remove('ID')
    if '控制人ID' in features:
        features.remove('控制人ID')
    if 'flag' in features:
        features.remove('flag')

    sparse_feature = ['行业','区域','企业类型','控制人类型']

    df_train = finally_data[features]

    # 对类别特征进行ont-hot编码
    for s in ['行业','区域','企业类型','控制人类型']:
        df_train=pd.concat([df_train,pd.get_dummies(df_train[s],prefix=s+'_')],axis=1)
        df_train.drop(s,axis=1,inplace=True)


    features = df_train.columns.tolist()
    col = ['注册时间', '注册资本', '控制人持股比例', '2015_债权融资额度', '2015_债权融资成本', '2015_股权融资额度',
           '2015_股权融资成本', '2015_内部融资和贸易融资额度', '2015_内部融资和贸易融资成本',
           '2015_项目融资和政策融资额度', '2015_项目融资和政策融资成本', '2015_从业人数', '2015_资产总额',
           '2015_负债总额', '2015_营业总收入', '2015_主营业务收入', '2015_利润总额', '2015_净利润', '2015_纳税总额',
           '2015_所有者权益合计', '2016_债权融资额度', '2016_债权融资成本', '2016_股权融资额度', '2016_股权融资成本',
           '2016_内部融资和贸易融资额度', '2016_内部融资和贸易融资成本', '2016_项目融资和政策融资额度',
           '2016_项目融资和政策融资成本', '2016_从业人数', '2016_资产总额', '2016_负债总额', '2016_营业总收入',
           '2016_主营业务收入', '2016_利润总额', '2016_净利润', '2016_纳税总额', '2016_所有者权益合计',
           '2017_债权融资额度', '2017_债权融资成本', '2017_股权融资额度', '2017_股权融资成本', '2017_内部融资和贸易融资额度',
           '2017_内部融资和贸易融资成本', '2017_项目融资和政策融资额度', '2017_项目融资和政策融资成本', '2017_从业人数',
           '2017_资产总额', '2017_负债总额', '2017_营业总收入', '2017_主营业务收入', '2017_利润总额', '2017_净利润',
           '2017_纳税总额', '2017_所有者权益合计', '专利', '商标', '著作权', '2015_债权融资额度|2015_净利润|sub',
           '2015_债权融资额度|2015_纳税总额|mul', '2015_债权融资额度|2017_从业人数|sub',
           '2015_债权融资额度|2016_内部融资和贸易融资成本|add', '2015_债权融资额度|2017_纳税总额|div',
           '2015_债权融资额度|2015_内部融资和贸易融资额度|add', '2015_债权融资额度|2015_纳税总额|add',
           '2015_债权融资额度|2016_净利润|div', '2015_债权融资额度|2017_纳税总额|add', '2015_债权融资额度|2015_净利润|mul',
           '2015_债权融资额度|2016_净利润|add', '2015_债权融资额度|2017_净利润|add', '2015_债权融资额度|2015_纳税总额|div',
           '2015_债权融资额度|2017_资产总额|sub', '2015_债权融资额度|2017_营业总收入|div', '2015_债权融资额度|2016_营业总收入|add',
           '2015_债权融资额度|2017_所有者权益合计|div', '2015_债权融资额度|2017_净利润|div', '2015_债权融资额度|2015_负债总额|sub',
           '2015_债权融资额度|2017_从业人数|add', '2015_债权融资额度|2017_主营业务收入|div', '2015_债权融资额度|2017_利润总额|sub',
           '2015_债权融资额度|2016_纳税总额|div', '2015_债权融资额度|2016_从业人数|sub', '2015_债权融资额度|2015_纳税总额|sub',
           '2015_债权融资额度|2016_纳税总额|add', '2015_债权融资额度|2015_从业人数|sub', '2015_债权融资额度|2016_净利润|sub',
           '2015_债权融资额度|2016_净利润|mul', '2015_债权融资额度|2017_净利润|sub', '2015_债权融资额度|2015_从业人数|add',
           '2015_债权融资额度|2015_净利润|add', '2015_债权融资额度|2016_从业人数|add',
           '2015_债权融资额度|2017_内部融资和贸易融资成本|add', '2015_债权融资额度|2017_股权融资成本|add',
           '2015_债权融资额度|2015_净利润|div', '2015_债权融资额度|2017_纳税总额|sub', '2015_债权融资额度|2016_纳税总额|sub',
           '2015_债权融资额度|2015_营业总收入|add', '2015_债权融资额度|2015_营业总收入|sub', '2015_债权融资额度|2017_净利润|mul',
           '2015_债权融资额度|2016_股权融资额度|add', '2015_债权融资额度|2016_所有者权益合计|add',
           '2015_债权融资额度|2016_资产总额|sub', '2015_债权融资额度|2017_纳税总额|mul', '2015_债权融资成本|2015_营业总收入|sub',
           '2015_债权融资成本|2017_纳税总额|add', '2015_债权融资成本|2017_纳税总额|div', '2015_债权融资成本|2015_净利润|mul',
           '2015_债权融资成本|2017_净利润|add', '2015_债权融资成本|2016_纳税总额|sub', '2015_债权融资成本|2015_纳税总额|sub',
           '2015_债权融资成本|2015_纳税总额|add', '2015_债权融资成本|2016_净利润|div', '2015_债权融资成本|2016_净利润|sub',
           '2015_债权融资成本|2017_营业总收入|sub', '2015_债权融资成本|2016_净利润|add', '2015_债权融资成本|2015_营业总收入|add',
           '2015_债权融资成本|2017_纳税总额|sub', '2015_债权融资成本|2016_纳税总额|add', '2015_债权融资成本|2017_从业人数|add',
           '2015_债权融资成本|2015_内部融资和贸易融资成本|add', '2015_债权融资成本|2016_纳税总额|div',
           '2015_债权融资成本|2015_净利润|add', '2015_债权融资成本|2017_营业总收入|add', '2015_债权融资成本|2015_净利润|sub',
           '2015_债权融资成本|2017_净利润|sub', '2015_债权融资成本|2015_从业人数|add', '2015_股权融资额度|2016_净利润|mul',
           '2015_股权融资额度|2016_纳税总额|add', '2015_股权融资额度|2015_内部融资和贸易融资额度|add',
           '2015_股权融资额度|2015_营业总收入|add', '2015_股权融资额度|2015_营业总收入|sub',
           '2015_股权融资额度|2017_内部融资和贸易融资成本|add', '2015_股权融资额度|2017_纳税总额|mul',
           '2015_股权融资额度|2017_纳税总额|sub', '2015_股权融资额度|2016_主营业务收入|sub',
           '2015_股权融资额度|2016_净利润|div', '2015_股权融资额度|2016_净利润|sub', '2015_股权融资额度|2017_净利润|sub',
           '2015_股权融资额度|2016_资产总额|sub', '2015_股权融资额度|2016_净利润|add', '2015_股权融资额度|2015_纳税总额|sub',
           '2015_股权融资额度|2015_从业人数|sub', '2015_股权融资额度|2017_净利润|add', '2015_股权融资额度|2015_净利润|sub',
           '2015_股权融资额度|2015_纳税总额|add', '2015_股权融资额度|2016_纳税总额|sub', '2015_股权融资额度|2015_净利润|add',
           '2015_股权融资额度|2017_纳税总额|add', '2015_股权融资额度|2017_纳税总额|div', '2015_股权融资额度|2016_纳税总额|div',
           '2015_股权融资成本|2017_纳税总额|sub', '2015_股权融资成本|2017_净利润|sub', '2015_股权融资成本|2016_纳税总额|sub',
           '2015_股权融资成本|2015_利润总额|add', '2015_股权融资成本|2016_纳税总额|div', '2015_股权融资成本|2016_净利润|add',
           '2015_股权融资成本|2017_营业总收入|sub', '2015_股权融资成本|2016_净利润|mul', '2015_股权融资成本|2017_主营业务收入|sub',
           '2015_股权融资成本|2015_净利润|add', '2015_股权融资成本|2017_从业人数|add', '2015_股权融资成本|2015_纳税总额|add',
           '2015_股权融资成本|2016_股权融资成本|add', '2015_股权融资成本|2017_项目融资和政策融资成本|add',
           '2015_股权融资成本|2017_纳税总额|mul', '2015_股权融资成本|2017_纳税总额|div',
           '2015_股权融资成本|2017_内部融资和贸易融资成本|add', '2015_股权融资成本|2017_净利润|div',
           '2015_股权融资成本|2015_纳税总额|sub', '2015_股权融资成本|2015_从业人数|add', '2015_股权融资成本|2016_净利润|sub',
           '2015_股权融资成本|2015_净利润|sub', '2015_股权融资成本|2016_纳税总额|add', '2015_股权融资成本|2015_营业总收入|add',
           '2015_股权融资成本|2017_纳税总额|add', '2015_股权融资成本|2017_净利润|add', '2015_内部融资和贸易融资额度|2016_净利润|mul',
           '2015_内部融资和贸易融资额度|2015_纳税总额|mul', '2015_内部融资和贸易融资额度|2015_纳税总额|sub',
           '2015_内部融资和贸易融资额度|2016_净利润|sub', '2015_内部融资和贸易融资额度|2015_净利润|add',
           '2015_内部融资和贸易融资额度|2016_纳税总额|add', '2015_内部融资和贸易融资额度|2015_从业人数|sub',
           '2015_内部融资和贸易融资额度|2015_纳税总额|add', '2015_内部融资和贸易融资额度|2015_净利润|sub',
           '2015_内部融资和贸易融资额度|2015_净利润|mul', '2015_内部融资和贸易融资额度|2016_纳税总额|sub',
           '2015_内部融资和贸易融资额度|2015_资产总额|mul', '2015_内部融资和贸易融资额度|2016_纳税总额|div',
           '2015_内部融资和贸易融资额度|2017_净利润|sub', '2015_内部融资和贸易融资额度|2017_内部融资和贸易融资额度|add',
           '2015_内部融资和贸易融资额度|2017_内部融资和贸易融资额度|mul', '2015_内部融资和贸易融资额度|2017_净利润|add',
           '2015_内部融资和贸易融资额度|2017_纳税总额|mul', '2015_内部融资和贸易融资额度|2016_净利润|add',
           '2015_内部融资和贸易融资额度|2017_内部融资和贸易融资成本|mul', '2015_内部融资和贸易融资额度|2017_纳税总额|div',
           '2015_内部融资和贸易融资额度|2017_纳税总额|add', '2015_内部融资和贸易融资成本|2017_净利润|sub',
           '2015_内部融资和贸易融资成本|2017_净利润|mul', '2015_内部融资和贸易融资成本|2016_纳税总额|add',
           '2015_内部融资和贸易融资成本|2016_净利润|sub', '2015_内部融资和贸易融资成本|2016_纳税总额|sub',
           '2015_内部融资和贸易融资成本|2017_纳税总额|add', '2015_内部融资和贸易融资成本|2017_净利润|add',
           '2015_内部融资和贸易融资成本|2017_内部融资和贸易融资额度|mul', '2015_内部融资和贸易融资成本|2017_纳税总额|div',
           '2015_内部融资和贸易融资成本|2016_净利润|add', '2015_内部融资和贸易融资成本|2015_净利润|add',
           '2015_内部融资和贸易融资成本|2015_纳税总额|add', '2015_内部融资和贸易融资成本|2015_项目融资和政策融资额度|add',
           '2015_内部融资和贸易融资成本|2017_纳税总额|mul', '2015_内部融资和贸易融资成本|2015_纳税总额|sub',
           '2015_内部融资和贸易融资成本|2015_净利润|mul', '2015_内部融资和贸易融资成本|2015_净利润|sub',
           '2015_内部融资和贸易融资成本|2015_从业人数|add', '2015_项目融资和政策融资额度|2016_净利润|sub',
           '2015_项目融资和政策融资额度|2017_净利润|sub', '2015_项目融资和政策融资额度|2015_净利润|sub',
           '2015_项目融资和政策融资额度|2016_净利润|add', '2015_项目融资和政策融资额度|2017_净利润|div',
           '2015_项目融资和政策融资额度|2017_净利润|mul', '2015_项目融资和政策融资额度|2015_资产总额|sub',
           '2015_项目融资和政策融资额度|2015_纳税总额|sub', '2015_项目融资和政策融资额度|2017_纳税总额|sub',
           '2015_项目融资和政策融资额度|2015_资产总额|add', '2015_项目融资和政策融资额度|2017_纳税总额|add',
           '2015_项目融资和政策融资额度|2015_纳税总额|div', '2015_项目融资和政策融资额度|2016_纳税总额|sub',
           '2015_项目融资和政策融资额度|2015_纳税总额|add', '2015_项目融资和政策融资额度|2016_纳税总额|div',
           '2015_项目融资和政策融资额度|2016_纳税总额|add', '2015_项目融资和政策融资额度|2016_所有者权益合计|div',
           '2015_项目融资和政策融资额度|2017_净利润|add', '2015_项目融资和政策融资额度|2015_净利润|add',
           '2015_项目融资和政策融资成本|2017_纳税总额|sub', '2015_项目融资和政策融资成本|2015_净利润|sub',
           '2015_项目融资和政策融资成本|2017_净利润|add', '2015_项目融资和政策融资成本|2017_主营业务收入|div',
           '2015_项目融资和政策融资成本|2015_利润总额|add', '2015_项目融资和政策融资成本|2015_净利润|add',
           '2015_项目融资和政策融资成本|2015_纳税总额|add', '2015_项目融资和政策融资成本|2017_内部融资和贸易融资成本|sub',
           '2015_项目融资和政策融资成本|2015_资产总额|add', '2015_项目融资和政策融资成本|2016_纳税总额|sub',
           '2015_项目融资和政策融资成本|2017_纳税总额|add', '2015_项目融资和政策融资成本|2016_净利润|add',
           '2015_项目融资和政策融资成本|2015_纳税总额|sub', '2015_项目融资和政策融资成本|2016_纳税总额|add',
           '2015_项目融资和政策融资成本|2017_净利润|div', '2015_项目融资和政策融资成本|2016_资产总额|add',
           '2015_项目融资和政策融资成本|2016_净利润|sub', '2015_项目融资和政策融资成本|2017_净利润|sub',
           '2015_从业人数|2017_纳税总额|add', '2015_从业人数|2015_净利润|sub', '2015_从业人数|2015_净利润|mul', '2015_从业人数|2017_净利润|mul', '2015_从业人数|2015_净利润|add', '2015_从业人数|2017_纳税总额|sub', '2015_从业人数|2016_纳税总额|add', '2015_从业人数|2016_所有者权益合计|div', '2015_从业人数|2015_纳税总额|sub', '2015_从业人数|2016_净利润|div', '2015_从业人数|2016_纳税总额|mul', '2015_从业人数|2016_净利润|sub', '2015_从业人数|2015_主营业务收入|sub', '2015_从业人数|2016_净利润|mul', '2015_从业人数|2015_纳税总额|add', '2015_从业人数|2016_净利润|add', '2015_从业人数|2015_营业总收入|mul', '2015_从业人数|2017_净利润|sub', '2015_从业人数|2017_净利润|div', '2015_从业人数|2016_纳税总额|sub', '2015_从业人数|2017_净利润|add', '2015_从业人数|2017_纳税总额|mul', '2015_从业人数|2015_净利润|div', '2015_从业人数|2017_营业总收入|mul', '2015_资产总额|2016_纳税总额|add', '2015_资产总额|2015_净利润|sub', '2015_资产总额|2016_纳税总额|sub', '2015_资产总额|2017_净利润|div', '2015_资产总额|2015_净利润|div', '2015_资产总额|2016_净利润|div', '2015_资产总额|2015_净利润|mul', '2015_资产总额|2017_净利润|mul', '2015_资产总额|2016_净利润|sub', '2015_资产总额|2016_净利润|mul', '2015_资产总额|2017_纳税总额|sub', '2015_资产总额|2015_纳税总额|sub', '2015_资产总额|2017_纳税总额|mul', '2015_资产总额|2016_纳税总额|mul', '2015_资产总额|2015_纳税总额|add', '2015_负债总额|2015_净利润|mul', '2015_负债总额|2017_净利润|mul', '2015_负债总额|2017_纳税总额|add', '2015_负债总额|2016_净利润|sub', '2015_负债总额|2015_净利润|div', '2015_负债总额|2015_纳税总额|add', '2015_负债总额|2016_净利润|mul', '2015_负债总额|2017_净利润|div', '2015_负债总额|2017_纳税总额|mul', '2015_负债总额|2015_纳税总额|div', '2015_负债总额|2016_纳税总额|add', '2015_负债总额|2017_净利润|add', '2015_负债总额|2016_净利润|div', '2015_负债总额|2016_净利润|add', '2015_负债总额|2017_纳税总额|sub', '2015_负债总额|2015_净利润|add', '2015_营业总收入|2017_净利润|mul', '2015_营业总收入|2015_纳税总额|sub', '2015_营业总收入|2017_净利润|div', '2015_营业总收入|2017_所有者权益合计|div', '2015_营业总收入|2016_纳税总额|add', '2015_营业总收入|2017_纳税总额|mul', '2015_营业总收入|2017_纳税总额|add', '2015_营业总收入|2016_净利润|add', '2015_营业总收入|2017_纳税总额|sub', '2015_营业总收入|2015_纳税总额|add', '2015_营业总收入|2016_净利润|div', '2015_营业总收入|2016_纳税总额|sub', '2015_营业总收入|2016_净利润|mul', '2015_营业总收入|2016_纳税总额|div', '2015_主营业务收入|2016_净利润|div', '2015_主营业务收入|2015_纳税总额|add', '2015_主营业务收入|2016_净利润|mul', '2015_主营业务收入|2016_纳税总额|add', '2015_主营业务收入|2017_纳税总额|mul', '2015_主营业务收入|2017_纳税总额|sub', '2015_主营业务收入|2017_净利润|div', '2015_主营业务收入|2015_纳税总额|mul', '2015_主营业务收入|2016_净利润|add', '2015_主营业务收入|2016_净利润|sub', '2015_主营业务收入|2017_纳税总额|add', '2015_主营业务收入|2015_净利润|sub', '2015_主营业务收入|2017_净利润|sub', '2015_主营业务收入|2017_净利润|add', '2015_主营业务收入|2017_净利润|mul', '2015_利润总额|2017_净利润|mul', '2015_利润总额|2015_纳税总额|sub', '2015_利润总额|2017_纳税总额|sub', '2015_利润总额|2017_负债总额|sub', '2015_利润总额|2016_净利润|mul', '2015_利润总额|2017_净利润|div', '2015_利润总额|2015_纳税总额|add', '2015_利润总额|2016_纳税总额|div', '2015_利润总额|2015_净利润|sub', '2015_利润总额|2015_净利润|add', '2015_利润总额|2016_净利润|div', '2015_利润总额|2017_纳税总额|add', '2015_净利润|2016_纳税总额|add', '2015_净利润|2017_纳税总额|div', '2015_净利润|2016_净利润|sub', '2015_净利润|2016_纳税总额|mul', '2015_净利润|2016_净利润|mul', '2015_净利润|2017_纳税总额|mul', '2015_净利润|2016_净利润|add', '2015_净利润|2016_纳税总额|sub', '2015_净利润|2016_净利润|div', '2015_净利润|2016_纳税总额|div', '2015_净利润|2017_净利润|div', '2015_净利润|2016_从业人数|add', '2015_净利润|2016_从业人数|div', '2015_净利润|2016_股权融资额度|add', '2015_净利润|2017_净利润|mul', '2015_净利润|2016_主营业务收入|add', '2015_净利润|2017_纳税总额|sub', '2015_净利润|2017_净利润|add', '2015_净利润|2017_纳税总额|add', '2015_净利润|2017_债权融资成本|add', '2015_纳税总额|2016_纳税总额|sub', '2015_纳税总额|2016_净利润|sub', '2015_纳税总额|2016_净利润|div', '2015_纳税总额|2017_纳税总额|add', '2015_纳税总额|2017_纳税总额|sub', '2015_纳税总额|2016_股权融资额度|div', '2015_纳税总额|2016_净利润|add', '2015_纳税总额|2017_净利润|div', '2015_纳税总额|2016_纳税总额|add', '2015_纳税总额|2017_纳税总额|mul', '2015_纳税总额|2016_纳税总额|div', '2015_纳税总额|2017_净利润|sub', '2015_纳税总额|2017_净利润|add', '2015_纳税总额|2016_纳税总额|mul', '2015_纳税总额|2017_纳税总额|div', '2016_债权融资额度|2017_净利润|add', '2016_债权融资成本|2017_纳税总额|add', '2016_债权融资成本|2017_净利润|add', '2016_债权融资成本|2016_纳税总额|add', '2016_债权融资成本|2017_从业人数|add', '2016_债权融资成本|2017_项目融资和政策融资成本|add', '2016_债权融资成本|2017_从业人数|sub', '2016_股权融资额度|2017_净利润|add', '2016_股权融资额度|2016_纳税总额|add', '2016_股权融资额度|2016_净利润|sub', '2016_股权融资额度|2016_净利润|add', '2016_股权融资成本|2017_主营业务收入|div', '2016_股权融资成本|2017_纳税总额|add', '2016_股权融资成本|2016_纳税总额|add', '2016_股权融资成本|2017_从业人数|add', '2016_股权融资成本|2017_净利润|add', '2016_股权融资成本|2017_净利润|div', '2016_内部融资和贸易融资额度|2017_净利润|sub', '2016_内部融资和贸易融资成本|2016_净利润|add', '2016_内部融资和贸易融资成本|2017_纳税总额|add', '2016_项目融资和政策融资额度|2017_纳税总额|add', '2016_项目融资和政策融资额度|2016_资产总额|sub', '2016_项目融资和政策融资额度|2016_净利润|add', '2016_项目融资和政策融资成本|2017_纳税总额|add', '2016_项目融资和政策融资成本|2016_纳税总额|add', '2016_从业人数|2016_净利润|div', '2016_从业人数|2017_净利润|div', '2016_从业人数|2017_净利润|mul', '2016_从业人数|2016_净利润|sub', '2016_资产总额|2016_净利润|div', '2016_资产总额|2017_纳税总额|sub', '2016_资产总额|2017_净利润|div', '2016_资产总额|2017_营业总收入|div', '2016_资产总额|2017_主营业务收入|div', '2016_资产总额|2016_营业总收入|mul', '2016_资产总额|2016_净利润|add', '2016_资产总额|2016_净利润|sub', '2016_资产总额|2017_纳税总额|add', '2016_资产总额|2016_纳税总额|add', '2016_营业总收入|2017_净利润|mul', '2016_营业总收入|2017_净利润|div', '2016_营业总收入|2016_净利润|add', '2016_营业总收入|2017_所有者权益合计|sub', '2016_营业总收入|2016_纳税总额|add', '2016_主营业务收入|2017_纳税总额|add', '2016_主营业务收入|2017_净利润|mul', '2016_主营业务收入|2016_纳税总额|add', '2016_利润总额|2017_主营业务收入|div', '2016_利润总额|2017_营业总收入|div', '2016_利润总额|2017_净利润|mul', '2016_净利润|2017_净利润|mul', '2016_净利润|2016_纳税总额|add', '2016_净利润|2017_净利润|div', '2016_净利润|2017_纳税总额|add', '2016_净利润|2017_项目融资和政策融资成本|sub', '2016_净利润|2017_纳税总额|sub', '2016_净利润|2017_纳税总额|div', '2016_净利润|2016_所有者权益合计|div', '2016_净利润|2017_净利润|add', '2016_净利润|2017_股权融资额度|add', '2016_净利润|2017_股权融资成本|add', '2016_净利润|2016_纳税总额|sub', '2016_净利润|2017_利润总额|div', '2016_纳税总额|2017_净利润|sub', '2016_纳税总额|2017_从业人数|add', '2016_纳税总额|2017_净利润|div', '2016_纳税总额|2017_净利润|add', '2016_纳税总额|2017_纳税总额|add', '2017_股权融资额度|2017_纳税总额|add', '2017_股权融资成本|2017_纳税总额|add', '2017_从业人数|2017_净利润|add', '2017_从业人数|2017_纳税总额|add', '2017_资产总额|2017_净利润|div', '2017_净利润|2017_所有者权益合计|div', '行业__交通运输业', '行业__商业服务业', '行业__工业', '行业__服务业', '行业__社区服务', '行业__零售业', '区域__山东', '区域__广东', '区域__广西', '区域__江西', '区域__湖北', '区域__湖南', '区域__福建', '企业类型__农民专业合作社', '企业类型__合伙企业', '企业类型__有限责任公司', '企业类型__股份有限公司', '企业类型__集体所有制企业', '控制人类型__企业法人', '控制人类型__自然人']
    new_df_train = pd.DataFrame()

    # catboost可以自己处理类别特征 所以取消我们之前的one-hot编码
    del_f = []
    for s in ['行业', '区域', '企业类型', '控制人类型']:
        for feat in col:
            if s in feat:
                del_f.append(feat)
    for f in del_f:
        col.remove(f)
    for s in ['行业', '区域', '企业类型', '控制人类型']:
        finally_data[s].fillna('空', inplace=True)
        col.append(s)
        df_train[s] = finally_data[s]


    for feature in col:
        if '|' in str(feature):
            f0,f1,method = feature.split('|')
            if method=='add':
                new_df_train['%s'%feature] = df_train[f0] + df_train[f1]
            if method=='sub':
                new_df_train['%s'%feature] = df_train[f0] - df_train[f1]
            if method=='mul':
                new_df_train['%s'%feature] = df_train[f0] * df_train[f1]
            if method=='div':
                new_df_train['%s'%feature] = df_train[f0] / df_train[f1]
        else:
            new_df_train['%s' % feature] = df_train[feature]

    clf = joblib.load('verify_catboost.m')
    y_pred = clf.predict(new_df_train.values)

    sub=finally_data[['ID']]
    sub['flag']=y_pred
    return sub

def predict(FILE_PATH,MODEL_PATH):
    base = os.path.join(FILE_PATH,'base.csv')
    money_info = os.path.join(FILE_PATH,'money_info.csv')
    paient_info = os.path.join(FILE_PATH,'paient_info.csv')
    year_report = os.path.join(FILE_PATH,'year_report.csv')

    result = predict_(base, money_info, year_report, paient_info)
    result.to_csv(os.path.join(FILE_PATH, "predictResult.csv"))
    
#predict('base_train_sum.csv','money_report_train_sum.csv','year_report_train_sum.csv','knowledge_train_sum.csv')